IDEA Open Model
CrossSectionGeneralColdFormed.Centerline Property
Compatible with IDEA StatiCa 20.1
 Centerline of cross-section made from linear segments
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public PolyLine2D Centerline { get; set; }
Public Property Centerline As PolyLine2D
	Get
	Set
Property Value
Type: PolyLine2D
See Also
Reference
CrossSectionGeneralColdFormed Class
IdeaRS.OpenModel.CrossSection Namespace